app/views/users/likes.html.erb

      <!-- Define the post variable -->
      <% post = Post.find_by(id: like.post_id) %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]