app/controllers/post_controller.rb

  def show
    @post = Post.find_by(id: params[:id])
    @user = @post.user
    @likes_count = Like.where(post_id: @post.id).count
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 11]]

  def create
    @post = Post.new(content: params[:content],user_id: @current_user.id)
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "hey"], ["created_at", "2021-09-22 13:41:30.518294"], ["updated_at", "2021-09-22 13:41:30.518294"], ["user_id", "9"]]

  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    if @post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "jakartas"], ["updated_at", "2021-09-22 13:50:35.522081"], ["id", 13]]

  def ensure_correct_user
    @post = Post.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]