app/controllers/post_controller.rb

UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "Astagfirullaah"], ["updated_at", "2021-09-14 09:04:12.915257"], ["id", 3]]
---
  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    if @post.save