app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "password") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      image_name: "default_user.jpeg",
      password: params[:password]
    )
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Hanin Ayumi Lerian"], ["updated_at", "2021-09-22 14:22:23.362696"], ["id", 10]]
---
  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]

    if params[:image]
      @user.image_name = "#{@user.id}.jpeg"
      image = params[:image]
      File.binwrite("public/assets/image/#{@user.image_name}", image.read)
    end

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "kanglerian@gmail.com"], ["password", "lerian"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(
      email: params[:email],
      password: params[:password]
    )

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 9]]
---
  def likes
    @user = User.find_by(id: params[:id])
    @likes = Like.where(user_id: @user.id)