app/controllers/users_controller.rb

  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]

    if params[:image]
      @user.image_name = "#{@user.id}.jpeg"
      image = params[:image]
      File.binwrite("public/assets/image/#{@user.image_name}", image.read)
    end

    if @user.save
---
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "adhie@gmail.coms"], ["updated_at", "2021-09-16 12:46:54.633231"], ["id", 2]]